InformationRegisters/ГруппыАналогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГруппыАналогов</Name>
			<Comment>Группы аналогов номенклатуры</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Comment>Наименование аналога</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйПоГруппе</Name>
					<Comment>Признак главного аналога для группы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйПоПроизводителю</Name>
					<Comment>Признак главного по производителю для группы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>№ номенклатуры по каталогу</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Comment>Идентификатор группы аналогов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>АртикулДляПоиска</Name>
					<Comment>№ артикула для поиска</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Артикул</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель детали</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГруппыАналогов/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет объединение групп аналогов в единую группу.
//
// Параметры:
//  ГлавнаяГруппа        - Строка - Уникальный идентификатор поглощающей группы;
//  ПрисоединяемаяГруппа - Строка - Уникальный идентификатор поглощаемой группы;
//
Процедура ОбъединитьГруппы(ГлавнаяГруппа, ПрисоединяемаяГруппа) Экспорт
	
	// Получим элементы основной группы
	НаборЗаписейГлавнойГруппы = РегистрыСведений.ГруппыАналогов.СоздатьНаборЗаписей();
	НаборЗаписейГлавнойГруппы.Отбор.ИдентификаторГруппы.Значение      = ГлавнаяГруппа;
	НаборЗаписейГлавнойГруппы.Отбор.ИдентификаторГруппы.Использование = Истина;
	НаборЗаписейГлавнойГруппы.Прочитать();
	тзНаборЗаписейГлавнойГруппы = НаборЗаписейГлавнойГруппы.Выгрузить();
	
	// Создадим набор записей присоединяемой
	НаборЗаписейПрисоединяемойГруппы = РегистрыСведений.ГруппыАналогов.СоздатьНаборЗаписей();
	НаборЗаписейПрисоединяемойГруппы.Отбор.ИдентификаторГруппы.Значение      = ПрисоединяемаяГруппа;
	НаборЗаписейПрисоединяемойГруппы.Отбор.ИдентификаторГруппы.Использование = Истина;
	НаборЗаписейПрисоединяемойГруппы.Прочитать();
	
	// Будем просматривать присоединяемую группу и переливать ее в главную
	Пока НаборЗаписейПрисоединяемойГруппы.Количество() > 0 Цикл
		
		Если тзНаборЗаписейГлавнойГруппы.Найти(НаборЗаписейПрисоединяемойГруппы[0].Артикул,"Артикул") = Неопределено Тогда
			
			НоваяЗапись = НаборЗаписейГлавнойГруппы.Добавить();
			НоваяЗапись.ИдентификаторГруппы = ГлавнаяГруппа;
			ЗаполнитьЗначенияСвойств(
				НоваяЗапись,
				НаборЗаписейПрисоединяемойГруппы[0],
				"Артикул,Производитель,Наименование,ГлавныйПоГруппе,ГлавныйПоПроизводителю"
			);
			
		КонецЕсли;
		
		НаборЗаписейПрисоединяемойГруппы.Удалить(НаборЗаписейПрисоединяемойГруппы[0]);
		
	КонецЦикла;
	
	НаборЗаписейПрисоединяемойГруппы.Записать();
	НаборЗаписейГлавнойГруппы.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ЭтотОбъект.Количество() > 0 И ДанныеЗаполнения <> Неопределено Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект[0], ДанныеЗаполнения);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийРегистраСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ЭтотОбъект[0].АртикулДляПоиска <> Отбор.АртикулДляПоиска.Значение
		ИЛИ ЭтотОбъект[0].ИдентификаторГруппы <> Отбор.ИдентификаторГруппы.Значение
		ИЛИ ЭтотОбъект[0].Производитель <> Отбор.Производитель.Значение Тогда
		
		РегистрыСведенийГруппыАналогов = РегистрыСведений.ГруппыАналогов.СоздатьНаборЗаписей();
		РегистрыСведенийГруппыАналогов.Отбор.ИдентификаторГруппы.Установить(ЭтотОбъект[0].ИдентификаторГруппы, Истина);
		РегистрыСведенийГруппыАналогов.Отбор.АртикулДляПоиска.Установить(ЭтотОбъект[0].АртикулДляПоиска, Истина);
		РегистрыСведенийГруппыАналогов.Отбор.Производитель.Установить(ЭтотОбъект[0].Производитель, Истина);
		РегистрыСведенийГруппыАналогов.Прочитать();
		
		Если РегистрыСведенийГруппыАналогов.Количество() > 0 Тогда
			
			РегистрыСведенийГруппыАналогов.Очистить();
			РегистрыСведенийГруппыАналогов.Записать(Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// АПК:75 - выкл

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
		
	ДатаИзменения = ТекущаяДатаСеанса();
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		Запись.Автор = Пользователи.ТекущийПользователь();
		Запись.ДатаИзменения = ДатаИзменения;
	КонецЦикла;
	
	Если ЭтотОбъект.Количество() = 0
		И ЭтотОбъект.Модифицированность() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГруппыАналогов.ИдентификаторГруппы КАК ИдентификаторГруппы,
		|	ГруппыАналогов.АртикулДляПоиска КАК АртикулДляПоиска,
		|	ГруппыАналогов.Производитель КАК Производитель,
		|	ГруппыАналогов.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.ГруппыАналогов КАК ГруппыАналогов
		|ГДЕ
		|	ГруппыАналогов.ИдентификаторГруппы = &ИдентификаторГруппы";
		
		Запрос.УстановитьПараметр("ИдентификаторГруппы", Отбор.ИдентификаторГруппы.Значение);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Количество() = 2 Тогда
			//Должен остаться отбор только по ИдентификаторГруппы
			Отбор.АртикулДляПоиска.Использование = Ложь;
			Отбор.Производитель.Использование = Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// АПК:75 - вкл

#КонецОбласти

#КонецЕсли
